// Chapter 03 : ตัวดำเนินการ(operator)ต่างๆ

// 1. Operator 
// ตัวเลขปกติสามารถนำมา + - * / ได้ตามปกติ
// เครื่องหมายเท่ากับ คือ การกำหนดค่าให้

console.log(3.14 + 2.2)
console.log(10+10*2)
console.log(10/2)
var age = 12 + 10
console.log(age)

// แต่ในบางกรณีก็ต้องมีการเช็คผลลัพธ์ด้วยเพื่อให้ได้ผลตามที่ต้องการ
// เนื่องจากหลักการคำนวนจะไม่เหมือนกับที่เราใช้ในชีวิตประจำวัน
        
console.log(3.14 + 2)

// การคำนวนจะทำตาม Order of operations เสมอ
// ลำดับ : วงเล็บ > เลขยกกำลัง > คูณหาร > บวกลบ

console.log(2+2*2)
console.log((4+2*2/2*2+4+1-5+19)+91)

// 2. String concatenate
// การบวกกันของ string คือ การเอามาต่อกัน
// เป็นการต่อกันแบบไม่มีช่องว่าง ถ้าอยากได้ต้องใช้การเว้นวรรค

console.log("Hello" + " Jay")
var name = "Jay" + "Jay"
console.log(name)

